'''
常用快捷键:
    ctrl+d 快速复制选中内容
    ctrl+y 删除选中内容
    ctrl + alt + l 快速整理代码(容易和热键起冲突)
'''
print(11)
print(22)
print(33)
print(44)
print(55)

# 数字格式化输出
print("我今年19岁")
print("我今年%d岁" %(19))
print("我今年%.2f岁" %(19.36))

# 字符串格式化输出
print("这是一个%s人" %("好"))
print("这是%s个%s人" %("一","坏"))

"""
格式符号         转换
%i			   表示一个int类型的元素
%d             有符号的十进制整数
%s             通过字符串格式化
%c             字符
%u             无符号的十进制整数
%o             八进制整数
%x/X           十六进制整数
%e/E           索引符号
%f             浮点实数
"""




