# &  按位与运算符
# 相应的位数都为1，则该位的结果是1，否则为0

# |  按位或运算符
# 两个二进制位有一个为1时，结果为1


# ^ 按位异或运算符
# 二进制的两位相异时，结果为1


# ~ 按位取反运算符
# 每个二进制数据位取反，1变0,0变1

# << 左移动运算符
# 各二进制位全部左移动若干位，由<<右侧数字决定，高位丢弃，低位补0


# << 右移动运算符
# 各二进制位全部右移动若干位，由<<右侧数字决定

'''
0000 1010
0000 0110
----------
0000 0010
'''
a = 10
b = 6
print(a & b)
print(a | b)

print(a and b)
print(b and a)
'''
0000 1010
0000 0110
----------
0000 1100
'''
print(a ^ b)


'''
0000 1010
1111 0101
1111 0100
1000 1011
'''
print(~a)


'''
0000 1010
0000 0101      
'''

print(a >> 1)

'''
0000 1010
0001 0100     
'''
print(a << 1)




